CSI API ETABS v1
cDetailing.GetDetailedWall_OneWallStack_OnePier_OneDesignLeg_OneTieBarInfo Method
 Represents one Rebar Tie/Stirrup set in a Design Leg, in local axis
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetDetailedWall_OneWallStack_OnePier_OneDesignLeg_OneTieBarInfo(
	int WallStackIndex,
	int PierIndex,
	int DesignLegIndex,
	int TieBarIndex,
	ref string GUID,
	ref double BarSize_Dia,
	ref double BarSize_Area,
	ref double BarSize_Fy,
	ref string BarSize_Notation,
	ref double Spacing,
	ref double StartZ,
	ref double EndZ,
	ref int TieShape,
	ref int NumberOfTiePlines
)
Function GetDetailedWall_OneWallStack_OnePier_OneDesignLeg_OneTieBarInfo (
	WallStackIndex As Integer,
	PierIndex As Integer,
	DesignLegIndex As Integer,
	TieBarIndex As Integer,
	ByRef GUID As String,
	ByRef BarSize_Dia As Double,
	ByRef BarSize_Area As Double,
	ByRef BarSize_Fy As Double,
	ByRef BarSize_Notation As String,
	ByRef Spacing As Double,
	ByRef StartZ As Double,
	ByRef EndZ As Double,
	ByRef TieShape As Integer,
	ByRef NumberOfTiePlines As Integer
) As Integer
Dim instance As cDetailing
Dim WallStackIndex As Integer
Dim PierIndex As Integer
Dim DesignLegIndex As Integer
Dim TieBarIndex As Integer
Dim GUID As String
Dim BarSize_Dia As Double
Dim BarSize_Area As Double
Dim BarSize_Fy As Double
Dim BarSize_Notation As String
Dim Spacing As Double
Dim StartZ As Double
Dim EndZ As Double
Dim TieShape As Integer
Dim NumberOfTiePlines As Integer
Dim returnValue As Integer
returnValue = instance.GetDetailedWall_OneWallStack_OnePier_OneDesignLeg_OneTieBarInfo(WallStackIndex,
	PierIndex, DesignLegIndex, TieBarIndex,
	GUID, BarSize_Dia, BarSize_Area,
	BarSize_Fy, BarSize_Notation, Spacing,
	StartZ, EndZ, TieShape, NumberOfTiePlines)
int GetDetailedWall_OneWallStack_OnePier_OneDesignLeg_OneTieBarInfo(
	int WallStackIndex,
	int PierIndex,
	int DesignLegIndex,
	int TieBarIndex,
	String^% GUID,
	double% BarSize_Dia,
	double% BarSize_Area,
	double% BarSize_Fy,
	String^% BarSize_Notation,
	double% Spacing,
	double% StartZ,
	double% EndZ,
	int% TieShape,
	int% NumberOfTiePlines
)
abstract GetDetailedWall_OneWallStack_OnePier_OneDesignLeg_OneTieBarInfo :
        WallStackIndex : int *
        PierIndex : int *
        DesignLegIndex : int *
        TieBarIndex : int *
        GUID : string byref *
        BarSize_Dia : float byref *
        BarSize_Area : float byref *
        BarSize_Fy : float byref *
        BarSize_Notation : string byref *
        Spacing : float byref *
        StartZ : float byref *
        EndZ : float byref *
        TieShape : int byref *
        NumberOfTiePlines : int byref -> int
Parameters
WallStackIndex
Type: System.Int32
 Wall Stack Index
PierIndex
Type: System.Int32
 Pier Output Index
DesignLegIndex
Type: System.Int32
 Design leg Index
TieBarIndex
Type: System.Int32
 Tie bar Index
GUID
Type: System.String
 GUID
BarSize_Dia
Type: System.Double
 Information about the size of Rebar Dia
BarSize_Area
Type: System.Double
 Information about the size of Rebar Area
BarSize_Fy
Type: System.Double
 Information about the size of Rebar Fy
BarSize_Notation
Type: System.String
 Information about the size of Rebar Notation
Spacing
Type: System.Double
 Spacing of Tie, along the height
StartZ
Type: System.Double
 Starting offset for placing the ties, along height, with respect to Design Leg Z Level
EndZ
Type: System.Double
 Starting offset for placing the ties, along height, with respect to Design Leg Z Level
TieShape
Type: System.Int32
 Shape of the Tie Straight, JoggleSingle, JoggleDouble, Rectangular, Diamond, UEqual, UunEqqual, Circle, Spiral, RectangularLapped 'Incident #16730, Rectangle90, Rectangle135, RectLap90 'Incident #16730, RectLap135 'Incident #16730, U90, U135, UandTie90, UandTie135, LTieWithLip, Circular
NumberOfTiePlines
Type: System.Int32
 Number of Polyline(s) of the Bar shapes, in Local Design Leg Coordinates
Return Value
Type: Int32
Returns zero if the function is successful; otherwise it returns a nonzero value.
See Also
Reference
cDetailing Interface
ETABSv1 Namespace